Documents/ESB/ESB_Consumer_1006/003TestSample/SAMPLE_XML_MUST/BankCard/BC11_BankCardResndHistInqRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/BankCard/BankCardResndHistInqRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>BankCard</ServiceDomain>  
      <OperationName>BankCardResndHistInq</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:BankCardResndHistInqRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>BC11</v11:TxnId>  
        <v11:TxnNo>BC1100001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:CardNo>4020160604105620</v11:CardNo>  
        <v11:PageNo>1</v11:PageNo>  
        <v11:NoOfPage>1</v11:NoOfPage> 
      </v11:ServiceBody> 
    </v11:BankCardResndHistInqRq> 
  </soap:Body> 
</soap:Envelope>
